{"basics":{"name":"Christian Orozco","label":"Data Analyst | Automation Engineer","image":"","email":"cfl.orozco@gmail.com","phone":"(405) 667-0060","url":"https://www.linkedin.com/in/chrisorozco1097/","summary":"A German-born theoretical physicist, widely ranked among the greatest and most influential scientists of all time","location":{"city":"Seattle","countryCode":"US","region":"Washington"},"profiles":[{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}]},"work":[{"name":"The University of Oklahoma","position":"Senior Data Analyst","url":"https://www.ou.edu/","startDate":"Jan 2021","endDate":"Present","image":"OU_logo.png","summary":["Developed and deployed end-to-end BI solutions, including dashboards, scorecards, and analytics using Power BI.","Integrated datasets from MySQL and cloud-based sources, aligning closely with operational and financial KPIs.","Led report development efforts in a data warehousing context, applying normalized and dimensional modeling techniques to support ETL pipelines.","Automated recurring business processes and file transfers using Power Automate, reducing manual effort and improving data integrity.","Designed and implemented custom applications to standardize data entry and ensure consistency across cross-functional teams.","Authored SQL queries and stored procedures to support data extraction, transformation, and loading (ETL).","Collaborated with administrative, facilities, and operations teams to analyze metrics and trends and create custom reports.","Experience developing in environments with a strong focus on operational KPIs, contact center metrics, and compliance.","Demonstrated working knowledge of SharePoint integration, Excel automation, and scripting for data manipulation and reporting.","Proven ability to align technical solutions with business needs by leveraging a strong foundation in operational processes and financial systems."],"highlights":["Relativity","High"],"location":"Norman, OK"},{"name":"E80 Group","position":"Automation Engineer","url":"https://www.e80group.com/en/","startDate":"Jul 2022","endDate":"Jan 2024","image":"E80_logo.png","summary":["Collaborated with cross-functional teams to drive the design, development, and successful implementation of automation solutions, leading to a significant increase in productivity. Demonstrated proficiency in software development to effectively create and maintain applications.","Executed SQL queries proficiently to enforce traffic rules, ensuring a high level of data consistency and accuracy within the automation domain."],"location":"Skokie, IL"},{"name":"Tecnologico de Monterrey","position":"Teaching Assistant","url":"https://tec.mx/en","startDate":"Jan 2021","endDate":"Jul 2022","image":"TEC_logo.png","summary":["Mentored undergraduate students in control systems, manufacturing processes, and industrial networks using tools like MATLAB-Simulink, TIA Portal, and RSLogix.","Led the development of a specialized course in partnership with GENERAC, focusing on Deep Sea Electronics and CAN communication (2022).","Assessed student performance and integrated real-world PLC programming scenarios to enhance applied learning outcomes."],"location":"Mexico City, MX"},{"name":"Boston Children's Hospital | Harvard Medical School","position":"Research Assistant","url":"https://research.childrenshospital.org/research-units/fetal-neonatal-neuroimaging-and-developmental-science-center-research","startDate":"Jul 2019","endDate":"Jan 2020","image":"BCH_logo.png","image2":"HMS_logo.png","summary":["Improved and enhanced a Deep Learning algorithm for precise fetal brain detection utilizing MRI data at the prestigious Fetal-Neonatal Neuroimaging and Developmental Science Center (FNNDSC) as part of an internship through the Harvard Medical School.","Skillfully employed Keras-TensorFlow Python libraries, adhering strictly to implementation prerequisites, to develop the cutting-edge algorithm."],"location":"Boston, MA"}],"education":[{"institution":"Tecnologico de Monterrey","location":"Mexico City, Mexico","url":"https://tec.mx/en","area":"Engineering Sciences","studyType":"Master's Degree","startDate":"Aug 2020","endDate":"Jul 2022","image":"TEC_logo.png","score":"98","courses":["Robotics","Data Science","Machine Learning"]},{"institution":"Tecnologico de Monterrey","location":"Gudalajara, Mexico","url":"https://tec.mx/en","area":"Mechatronics Engineering","studyType":"Bachelor's Degree","startDate":"Aug 2015","endDate":"Jul 2020","image":"TEC_logo.png","score":"93","courses":["Robotics","Mathematics","Statistics"]},{"institution":"Massachusetts Institute of Tecnology","location":"Boston, MA","url":"https://www.mit.edu/","studyType":"Exchange Program","startDate":"Aug 2019","endDate":"Dec 2019","image":"MIT_logo.png","courses":["Signals and Systems","Gender Studies","Mathematics"]},{"institution":"Universidad Autonoma de Madrid","location":"Madrid, Spain","url":"https://www.uam.es/uam/inicio","studyType":"Exchange Program","startDate":"Jan 2019","endDate":"Jun 2019","image":"UAM_logo.png","courses":["Statistics","Communication Theory","Applied Mathematics"]}],"certificates":[{"name":"Power BI Data Analyst Associate","date":"June 5th, 2025","issuer":"Microsoft","image":"MICR_logo.png","url":"https://learn.microsoft.com/api/credentials/share/en-us/ChristianOrozco-4940/28C05101280571CF?sharingId=A8FF5B8C6D4E8388","icon":"fa-solid fa-clipboard-check"},{"name":"Azure Data Fundamentals","date":"May 17th, 2025","issuer":"Microsoft","image":"MICR_logo.png","url":"https://learn.microsoft.com/api/credentials/share/en-us/ChristianOrozco-4940/8A9945BF0DD32041?sharingId=A8FF5B8C6D4E8388","icon":"fa-solid fa-clipboard-check"},{"name":"Azure Fundamentals","date":"May 22nd, 2025","issuer":"Microsoft","image":"MICR_logo.png","url":"https://learn.microsoft.com/api/credentials/share/en-us/ChristianOrozco-4940/A78334B414F40CBB?sharingId=A8FF5B8C6D4E8388","icon":"fa-solid fa-clipboard-check"}],"projects":[{"name":"Safety Scoreboard Tracker","summary":"Centralized meter reading tracking system with anomaly detection and trend monitoring.","url":"1_project","image":"SI_logo.png","objective":"Previously, the Safety Department relied on a whiteboard to manually track workplace incidents — a process that was error-prone, time-consuming, and lacked historical insights. My goal was to digitize and automate this process, enabling real-time tracking, trend analysis, and data-driven decision-making."},{"name":"Facility Services Yearly KPIs","summary":"Automated yearly dashboard tracking key performance indicators for Facility Services.","url":"3_project","image":"FSY_logo.png","objective":"The goal of this project was to reconcile discrepancies between two critical operational systems: Workforce, used for employee clock-in/out and payroll processing, and AiM, the work order management platform for tracking labor against maintenance tasks and service requests."},{"name":"Workforce vs AiM Hours Reconciliation","summary":"Automated tracking system for labor hour reconciliation between Workforce and AiM.","url":"2_project","image":"WFA_logo.png","objective":"This project focused on digitizing and automating the yearly performance reporting process for the Facility Services Department, by integrating operational data from AiM (maintenance management system) and HR-related metrics from Workforce (timekeeping and attendance system)."},{"name":"Meter Reading & Usage Tracker","summary":"Centralized meter reading tracking system with anomaly detection and trend monitoring.","url":"4_project","image":"METER_logo.png","objective":"The Utilities Department needed a way to centralize utility meter readings from multiple systems while ensuring data quality before proceeding to billing. Previously, the process involved disparate spreadsheets and manual checks that resulted in inconsistent tracking and delayed validations."},{"name":"Invoice Automation - Energy Management","summary":"Automated invoice reading and processing using AI and data pipelines to streamline utility billing in AiM.","url":"5_project","image":"INV_logo.png","objective":"Manually processing over 350 monthly utility invoices was a time-consuming and error-prone process for the Energy Management team. Each invoice had to be reviewed, entered line by line into AiM, and validated, often taking multiple days per month."},{"name":"Employee Extracts - Payroll Validation","summary":"Automated biweekly payroll verification system to ensure accuracy of employee hours and salary rates before payroll processing.","url":"6_project","image":"EXTR_logo.png","objective":"The HR Department was responsible for validating payroll extracts received on a biweekly basis, manually reviewing discrepancies in employee rates and hours before final payroll submission. With over 500 employees and data spread across multiple systems (PeopleSoft, AiM, Workforce), this task was time-consuming, error-prone, and often delayed due to the lack of quick comparison tools."},{"name":"Smart Warehouse Automation","summary":"Deployment, programming, and optimization of Laser Guided Vehicles (LGVs) for automated product handling in a smart warehouse environment.","url":"7_project","image":"AGV_logo.png","objective":"The primary objective of this project was to implement and optimize the use of Laser Guided Vehicles (LGVs) within a high-capacity smart warehouse, automating the complete flow of materials including product picking, transport, and storage. By integrating cutting-edge automation technology, the project sought to drastically improve operational efficiency, ensure high safety standards, and reduce manual handling, all while maintaining flexibility for different product types and warehouse layouts."},{"name":"LGV Navigation Optimization","summary":"Development and optimization of advanced navigation logic for Laser Guided Vehicles (LGVs) using SQL-driven traffic rules and warehouse segmentation for efficient and safe automated transport.","url":"8_project","image":"NAV_logo.png","objective":"This project focused on creating a fully functional and safe navigation system for Laser Guided Vehicles (LGVs) by developing advanced traffic logic and segmentation strategies within the warehouse layout. The primary goal was to prevent operational bottlenecks and deadlocks while ensuring efficient and collision-free material transport through high-precision laser navigation combined with smart traffic rules."}],"publications":[{"name":"Complex thinking and robotics: a proposal for sexual and gender diversity and inclusion training","publisher":"Emerald Publishing","releaseDate":"June 27th, 2024","image":"EP_logo.png","url":"https://www.emerald.com/insight/content/doi/10.1108/jarhe-10-2023-0475/full/html","summary":"This study proposes using humanoid robots to deliver workshops on LGBTQIA+ topics for high school and university students, fostering complex thinking skills. It highlights the need for inclusive education strategies, especially in institutions with limited resources. Findings suggest robotics can enhance engagement with diversity themes. The approach aims to make sexual and gender diversity education more impactful and engaging in academic environments."},{"name":"A systematic mapping literature review of education around sexual and gender diversities","publisher":"Frontiers in Sociology","releaseDate":"August 22nd, 2022","image":"FS_logo.png","url":"https://www.frontiersin.org/journals/sociology/articles/10.3389/fsoc.2022.946683/full","summary":"Conducted a systematic mapping literature review analyzing 69 studies across five academic databases to assess how educational institutions address sexual and gender diversity. The study revealed a global lack of LGBTQ+ representation in curricula, limited use of technological tools, and a concentration of inclusive efforts within healthcare programs—especially scarce in Latin America. Findings highlight the positive impact of inclusive education on the LGBTQ+ community and the urgent need for broader, structured curricular integration."},{"name":"Use of Robotic Platforms as a Tool to Support STEM and Physical Education in Developed Countries: A Descriptive Analysis","publisher":"Sensors","releaseDate":"January 28th, 2022","image":"SEN_logo.png","url":"https://www.mdpi.com/1424-8220/22/3/1037","summary":"This study explored the integration of assistive robots in Mexican classrooms to address student disengagement caused by traditional teaching methods and digital distractions. Four approaches using LEGO®, NAO, and Hexapod robots were implemented across primary and higher education in STEM and physical education settings. Results demonstrated that robotic-assisted instruction significantly improved students’ attention span, motivation, and information retention, offering a dynamic alternative to conventional teaching."},{"name":"Physical therapy using robotics: A project-based learning experience for undergraduate students","publisher":"AJET: Australasian Journal of Educational Technology","releaseDate":"December 6th, 2021","image":"AJET_logo.png","url":"https://ajet.org.au/index.php/AJET/article/view/7139","summary":"This study applied a project-based learning approach in higher education to address real-world challenges, engaging engineering students in designing a physical therapy routine using the NAO robot. In collaboration with a rehabilitation institute in Mexico City, the project fostered empathy, patient interaction, and the development of a functional rehabilitation tool. Usability and reproducibility assessments, including Cronbach’s alpha, showed strong engagement and approval from both patients and medical staff."}],"skills":[{"name":"Programming & Scripting","level":"Advanced","icon":"fa-solid fa-code","keywords":["Python","R","SQL","DAX","Ladder Logic","JavaScript","HTML","CSS"]},{"name":"Engineering & Automation","level":"Advanced","icon":"fa-solid fa-gears","keywords":["RSLogix","TwinCAT","SolidWorks","MATLAB","Ladder Logic","Autodesk Inventor","CATIA"]},{"name":"Databases","level":"Intermediate","icon":"fa-solid fa-database","keywords":["MySQL","SQL Server","SQLite"]},{"name":"Data & Analytics","level":"Advanced","icon":"fa-solid fa-chart-line","keywords":["Power BI","Tableau","Google Analytics","Crystal Reports"]},{"name":"Automation & Integration","level":"Intermediate","icon":"fa-solid fa-plug","keywords":["Power Automate","Power Apps","Linux Scripting","Git"]},{"name":"Management Solutions","level":"Intermediate","icon":"fa-solid fa-briefcase","keywords":["PeopleSoft","AiM (AssetWorks)"]}],"languages":[{"language":"English","fluency":"Fluent","icon":"fa-solid fa-flag","image":"usa.png"},{"language":"Spanish","fluency":"Native Speaker","icon":"fa-solid fa-flag","image":"spa.png"},{"language":"Italian","fluency":"Conversational","icon":"fa-solid fa-flag","image":"ita.png"}],"awards":[{"title":"Integral Student Award","date":"May 2020","awarder":"Tecnologico de Monterrey","image":"student_award.PNG","url":"https://tec.mx/en","summary":"The Integral Student Award from Tecnológico de Monterrey is the highest recognition granted by the institution to its most outstanding student for their involvement across multiple areas beyond academics. This award is presented to a student that has shown exceptional commitment to their holistic development, including participation in social, artistic, athletic, leadership, and student development activities. The award is given to a student who meets graduation requirements and has excelled in the areas that make up the student experience at the University. The recipient is selected from among the graduating class of the current semester. This award aims to recognize the effort, dedication, and passion of young people in developing their skills and contributing positively to their academic community and society. This award reflects Tec de Monterrey’s holistic approach to education, focused on forming committed leaders and responsible citizens."},{"title":"Líderes del Mañana Scholarship","date":"May 2015","awarder":"Tecnologico de Monterrey","image":"LDM_logo.png","url":"https://lideresdelmanana.itesm.mx/","summary":"The Líderes del Mañana scholarship is a prestigious, full-tuition award granted by Tecnológico de Monterrey to top-performing high school graduates across Mexico. It recognizes exceptional students who demonstrate a strong academic record (minimum average of 90/100), proven leadership, and notable social commitment within their communities. Beneficiaries receive: 1. Full coverage of tuition costs 2. Support for insurance, books, and wellness resources 3.Access to mentorship, leadership development, and project incubation opportunities. Selection is highly competitive and holistic, based on academic excellence, financial need, demonstrated leadership in community initiatives, and a commitment to pay it forward through peer support and mentorship."}]}